import { Component } from '@angular/core';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrls: ['./about.component.scss']
})
export class AboutComponent {

  //Array
  specialtyArr = [
    { title: 'الدهانات الداخلية', description: 'إنتاج وتوريد البلاستيك والمعجون الأكريليك والسيلر بجودة وخامات عالية.' },
    { title: 'الدهانات الخارجية', description: 'الدهانات الأسمنتية والأكريليك والسيلر، مع ضمان الشركة لثبات الألوان لمدة عشر سنوات من تاريخ الإنتاج.' },
    { title: 'لاصق السيراميك والرخام', description: 'إنتاج وتوريد لاصق السيراميك والرخام (فيكس) للأرضيات والحوائط.' },
    { title: 'مواد العزل', description: 'إنتاج وتوريد مادة العزل الأسمنتية (البروف كوتنج).' },
    { title: 'سقية فواصل السيراميك', description: 'إنتاج وتوريد مادة سقية فواصل السيراميك (الجروات).' },
  ]

  approvedProjectArr = [
    'مشروع دار مصر',
    'مشروع سكن مصر',
    'الإسكان الاجتماعي بأكتوبر ودهشور',
    'مشروع نقابة المهندسين بالعبور',
    'مشروع قرية ريماس بالساحل الشمالي',
    'مشروع أبراج سما بالقطامية',
    'مشروع ستون ريزيدنس بالتجمع الخامس',
    'مركز البطاقات الشخصية بالسادس من أكتوبر',
  ]

}
